src/main/resources/Examples/Requests/GetChargesRequest.xml

<?xml version='1.0' encoding='utf-8'?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Body>
        <GetCharges xmlns="http://ProxyService">
            <xml>&lt;Operator>
                &lt;WhereOperator>And&lt;/WhereOperator>
                &lt;Nodes>
                &lt;Field>
                &lt;FieldOperator>StartingWith&lt;/FieldOperator>
                &lt;FieldName>ACCOUNT&lt;/FieldName>
                &lt;FieldValue>
                &lt;Column>
                &lt;ID>0&lt;/ID>
                &lt;Kind>String&lt;/Kind>
                &lt;ColumnName>&lt;/ColumnName>
                &lt;ColumnTitle>&lt;/ColumnTitle>
                &lt;Obligatory>False&lt;/Obligatory>
                &lt;Active>False&lt;/Active>
                &lt;RegExp>&lt;/RegExp>
                &lt;Searchable>False&lt;/Searchable>
                &lt;SystemField>False&lt;/SystemField>
                &lt;ExactSrch>False&lt;/ExactSrch>
                &lt;/Column>
                &lt;Field>
                &lt;IsEmpty>False&lt;/IsEmpty>
                &lt;Data>1175689795&lt;/Data>
                &lt;/Field>
                &lt;/FieldValue>
                &lt;/Field>

                &lt;Field>
                &lt;FieldOperator>StartingWith&lt;/FieldOperator>
                &lt;FieldName>VIDPAY&lt;/FieldName>
                &lt;FieldValue>
                &lt;Column>
                &lt;ID>0&lt;/ID>
                &lt;Kind>String&lt;/Kind>
                &lt;ColumnName>&lt;/ColumnName>
                &lt;ColumnTitle>&lt;/ColumnTitle>
                &lt;Obligatory>False&lt;/Obligatory>
                &lt;Active>False&lt;/Active>
                &lt;RegExp>&lt;/RegExp>
                &lt;Searchable>False&lt;/Searchable>
                &lt;SystemField>False&lt;/SystemField>
                &lt;ExactSrch>False&lt;/ExactSrch>
                &lt;/Column>
                &lt;Field>
                &lt;IsEmpty>False&lt;/IsEmpty>
                &lt;Data>55&lt;/Data>
                &lt;/Field>
                &lt;/FieldValue>
                &lt;/Field>

                &lt;/Nodes>
                &lt;/Operator>
            </xml>
            <dataList>
                <Data>
                    <Name>SESSION_ID</Name>
                    <Value>
                        FE94698A-6335-4A6B-B685-D29EC835C55E#dXwJAAYKfAcAAQYCAAAAcnAHAAMFegUAdwIPBwJ6cHBzcAdzTwsABgMedHEABg1lBx0OAHd/HHkJ
                        dAUb
                    </Value>
                </Data>
                <Data>
                    <Name>TYPE_CHRG_ID</Name>
                    <Value>52434</Value>
                </Data>
            </dataList>
        </GetCharges>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>